In [1]:
import pandas as pd
import numpy as np

In [2]:
url = r"C:\Users\gonza\OneDrive\Documentos\datascience-thebridge-master\ejercicios gonzalo\DATA\Titanic\titanic.csv"
data = pd.read_csv(url)
data.head(3)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250

In [5]:
dummy_sex = pd.get_dummies(data["Sex"],prefix="sex")
dummy_sex.head(4)

   sex_female  sex_male
0           0         1
1           1         0
2           1         0
3           1         0

In [7]:
column_names = data.columns.values.tolist()
column_names

['Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'Siblings/Spouses Aboard',
 'Parents/Children Aboard',
 'Fare']

In [8]:
data = data.drop(["Sex"],axis=1)

In [9]:
pd.concat([data,dummy_sex],axis=1)

,Survived,Pclass,Name,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,sex_female,sex_male
0,0,3,Mr. Owen Harris Braund,22.0,1,0,7.2500,0,1
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,38.0,1,0,71.2833,1,0
2,1,3,Miss. Laina Heikkinen,26.0,0,0,7.9250,1,0
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,35.0,1,0,53.1000,1,0
4,0,3,Mr. William Henry Allen,35.0,0,0,8.0500,0,1
...,...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,27.0,0,0,13.0000,0,1
883,1,1,Miss. Margaret Edith Graham,19.0,0,0,30.0000,1,0
884,0,3,Miss. Catherine Helen Johnston,7.0,1,2,23.4500,1,0
885,1,1,Mr. Karl Howell Behr,26.0,0,0,30.0000,0,1
886,0,3,Mr. Patrick Dooley,32.0,0,0,7.7500,0,1

## Plots y visualizacion

In [11]:
url = r"C:\Users\gonza\OneDrive\Documentos\datascience-thebridge-master\ejercicios gonzalo\DATA\telecom_churn.csv"
data1 = pd.read_csv(url)
data1.head(3)

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False